[
  {
    "id": "para_000007",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 7 basic health care. tice for victims was buried under elite power-sharing pacts. Since Government snacks diet could pay for a million Kenyans health then, every election cycle has been loaded with a grim toll. In 2013 In 2018, the high-profile Cuban doctor s programme30 stirred and 2017, security agencies used live bullets, arbitrary arrests, and The Institute for Social Accountability TISA has established that, up controversy for paying Cuban doctors more than double the tear gas to target mostly young people in informal settlements. across government, over KSh17 million a day is spent on drinks average salary of their Kenyan counterparts. It drained millions and snacks for government offices, as detailed in the Controller of of shillings from the health budget while side-lining local med- The 2022 elections served as a continuation of repression. In- Budget implementation report for the National Government for ical specialists. That same year, investigations revealed more stead of protecting citizen rights, the police are an instrument FY2024 25. than KSh10 billion looted from the National Health Insurance of state violence. The July 7, 2025 Saba Saba protests recorded Fund NHIF through fraudulent medical claims. Kenyans have 31 deaths and more than 500 arrests, with at least 38 killed over TISA calculates that this daily waste could, over 12 months, pay for learned -- especially after the Covid-19 pandemic -- that when di- five days. But despite overwhelming documentation by the Inde- full annual health insurance for over 1 million Kenyans. saster strikes, their leaders see business opportunities as a prior- pendent Policing Oversight Authority, KNCHR, and civil society, ity, not saving lives. impunity persists. No senior officials have been prosecuted, IPOA Aligning budget priorities to socially beneficial spending frees up has failed to publish its findings from these incidents, and only funds needed to achieve critical social indicators -- like a health fund Governance Linkage: Corruption in the health sector is not an two cases linked to the killing of protestors34 have reached the administrative error. Rather, it is budgetary capture. Each scan- courts. Instead, the president disregarded existing constitution- that is fully financed from general revenue and not from unpopular dal closes fiscal space for essential services, turning health crises al and legal frameworks and established a compensation panel, levies. into recurring political crimes.31 which has been stopped by a court injunction. Corruption scandals have robbed hospitals and health facilities Governance Linkage: Fiscal capture and political repression of resources for decades, depriving communities in remote areas 1.5 The true toll of abuse and inhumanity are two sides of the same coin. A state that loots public funds of basic care. This places citizens in a precarious situation where feels under pressure to silence dissent. The erosion of civic space they are one disease away from poverty or death. This crisis is best symbolised by Managed Equipment Services MES project, Human rights violations in Kenya have been written in the blood therefore serves as a governance indicator, revealing how eco- known as AfyaGate in 2015, when the government committed of citizens. The 2024 protests against the rejected Finance Bill nomic plunder depends on coercion and institutional decay.35 over KSh38 billion to lease medical equipment to the counties -- saw the worst crackdown on public assembly in recent history. but left most of the equipment gathering dust in the store rooms The Kenya National Commission on Human Rights KNCHR 1.6 Synthesis: Poverty poor governance are symptoms of a because the counties lacked vital infrastructure and trained staff. reported that more than 200 civilians were killed during pro- broken state Kenyans continue to pay for this equipment lease every year. tests, over 2,000 were arrested and dozens more were forcibly disappeared.32 The Missing Voices Coalition documented 159 po- Across all these lived realities: hunger, joblessness, collapsing ed- The Covid-19 pandemic in 2020 exposed the health sector s vul- lice-related killings and disappearances in 2024, consisting of 104 ucation, dying health systems, and human rights violations, the nerability, but it also deepened the pattern of corruption. An au- extrajudicial killings and 55 enforced disappearances. CIVICUS thread is clear: economic suffering in Kenya is simply a gover- dit by the Vaccine Alliance GAVI revealed that KSh160 million Monitor downgraded Kenya s civic space to Repressed in 2025.33 nance outcome, not an accident of policy. meant for vaccines had been misappropriated, and a Global Fund audit uncovered KSh63.7 million in fraudulent TB programme Corruption is not merely theft; it is a fiscal system of extraction. spending. The Kenya Medical Supplies Agency KEMSA and The promise of the 2010 Constitution to protect life, dignity, ex- Budgets and debt instruments have become tools of political sur- Covid-19 billionaires scandal led to the loss of at least KSh7.8 pression and assembly has been steadily clawed back after vival rather than public service. Poverty, unemployment and so- billion through inflated tenders and fake contracts. While the citizens fought hard to establish it. In the 1990s, pro-democracy cial collapse sit within a single analytical frame: the capture of politically connected suppliers grew rich, patients died due to activists were brutally repressed, with dozens killed, tortured, fiscal policy by elite networks erodes constitutional governance lack of oxygen and protective gear. Most recently, payments from and detained without trial. The contested 2007-2008 election left and social equity.36 the newly created Social Health Authority SHA have been sus- more than 1,100 dead and hundreds of thousands displaced; jus- pended because of fraudulent claims by over 80 health facilities, and at least 1,000 others are being investigated for receiving pay- 30 Africanews 2023 , Kenya government ends arrangement to swap ments without providing services. Launched in 2024, SHA has doctors with Cuba cost the taxpayer over KSh104 billion in system acquisition and 31 IMF 2023 . Kenya: Article IV Consultation and Governance Diagnostic installation. This comes in the wake of the 2016 theft of billions Report. 34 Independent Policing Oversight Authority 2025 . Annual Report on 32 Kenya National Commission on Human Rights 2024 . Finance Bill Use of Force and Firearms 2024. of shillings earmarked for free maternity care in the Afya House Protests Monitoring Report. 35 Amnesty International 2025 . Kenya: Excessive Force and Fiscal scandal, and another KSh1 billion looted through ghost suppli- 33 CIVICUS 2025 . Monitor on Kenya Civic Space Downgrade to Discontent Report. ers for mobile clinics, abandoning remote communities without Repressed. 36 IMF 2018 . Framework for Enhanced Engagement on Governance.",
    "page": 7,
    "tags": [
      "corruption",
      "statistic",
      "debt",
      "allegation",
      "human_rights",
      "finding",
      "legal_reference"
    ],
    "severity": "high"
  },
  {
    "id": "para_000013",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 13 3.2 Cascading corruption to the subnational economy The result is not governance failure but its redesign. Counties the 47 assemblies debated their annual audit reports within the have institutionalised rent extraction within a legal framework statutory three-month period after they were tabled, with several that appears participatory yet functions in an exploitative man- failing to constitute Public Accounts and Investments Commit- Devolution was Kenya s most ambitious democratic reform ner. tees PAICs in time.123 since independence. It was intended to dismantle centralised domination, promote equitable development, and bring gov- ernment closer to the people. A decade after this system of 3.2.3 Local service failure most visible in health and agricul- government was launched; this vision has been corroded ture by the same logic of capture that afflicts national institu- tions. Rather than becoming laboratories of participatory democracy, county governments now mirror the inefficien- cies, lack of transparency and patronage of the national state. The human impact of local capture is most visible in the health and agriculture sectors. Counties collectively spent The paradox of devolution lies in its promise being politically KSh115 billion on health in FY2023 24, which is about 30 per manipulated. Fiscal transfers to counties have expanded dramat- cent of their total budgets.114 Yet the Council of Governors re- ically, but service delivery and accountability have not. ports that 41 counties experienced stockouts of essential medicines, idle medical equipment and stalled projects.115 3.2.1 Economic promise versus political reality The Managed Equipment Services MES programme is one of the most emblematic cases of fiscal distortion. Despite Between FY2013 14 and FY2023 24, the national government an annual lease cost of KSh99.4 billion, many hospitals lack transferred more than KSh 3.4 trillion to the 47 counties, av- trained personnel or electricity to operate the machines.116 eraging 16 to 18 per cent of audited national revenue.105 County allocations grew from KSh210 billion to KSh385 billion over the Agriculture, which supports over 70 per cent of rural livelihoods, same period.106 Yet, this fiscal expansion has not translated into receives less than 6 per cent of county budgets, which is far below proportional improvements in public welfare. the 10 per cent commitment made in the Maputo Declaration.117 In FY2023 24, counties spent 71 per cent of their budgets on re- The Auditor General reported KSh12.8 billion in unsupported ag- current budget items, including salaries, allowances, travel, and ricultural spending in FY2023 24, including payments for unver- County Assemblies, conceived as bulwarks of fiscal accountabil- hospitality, leaving only 29 per cent for development.107 Only six ified farm inputs and non-existent farmer registries.118 ity, now often function as transactional chambers where loyalty counties received unqualified opinions from the Auditor Gen- is monetised, and oversight is traded for convenience. The cost of eral, while 32 were flagged for material misstatements and un- this dysfunction is borne by citizens, who fund budgets debated supported expenditure.108 Pending bills rose to KSh182 billion by in their name but executed against their interest. June 2024, most of them associated with non-existent projects, inflated contracts, and politically connected suppliers.109 3.2.5 Tension between governments in the struggle for re- Figure 5 shows the trend in county allocations against devel- sources opment absorption, exposing the widening gap between fiscal devolution and real outcomes. The promise of Kenya s devolved system was cooperative gov- ernance between the national and county levels. Yet, 12 years after implementation, that promise remains fragile. Counties operate in a condition of fiscal dependence, trapped between constitutional autonomy and the Treasury s discretion.124 In FY2023 24, equitable share transfers to counties were delayed by an average of ninety days.125 The Controller of Budget reported that 34 counties experienced unpaid salary arrears of up to two months, forcing some to take short-term bank overdrafts at com- The promise of localised service delivery has been replaced by mercial interest rates to finance payrolls.126 Such delays disrupt administrative mimicry; a bureaucracy that looks participatory service delivery, undermine development absorption, and expose on paper but remains extractive in practice. Citizens at the grass- counties to debt risks that the Constitution never envisaged. roots bear the heaviest burden of this mimicry 3.2.4 Oversight collapse and extension of the Executive in The tragedy of Kenya s devolution is that it has become a smaller county assemblies theatre for the same old corruption; decentralising expenditure without localising accountability. County Assemblies were established in the Constitution to act 3.2.2 How localised economic capture works as legislative and oversight bodies at the local level. Yet, more than a decade since devolution was launched, they have in- County governance has been designed to entrench executive creasingly become extensions of the executive arm of county dominance. Governors control procurement, recruitment, and governments.119 Oversight has been reduced to a transactional budget implementation, while county assemblies, empowered exercise, where governors secure political consent from Mem- under Article 185 to provide oversight, often act as extensions of bers of County Assemblies MCAs through privileges, foreign the executive.110 Political economists describe this phenomenon trips, and discretionary ward projects rather than accountability. as fragmented authoritarianism, where devolution multiplies centres of discretion without strengthening accountability.111 The Ethics and Anti-Corruption Commission s County Gov- TISA s Citizen Participation in County Budgeting Study 2024 ernance Integrity Index 2024 found that legislative capture found that only 14 per cent of counties meaningfully incorporat- remains pervasive across most devolved units.120 The re- ed citizen input into the approved budgets.112 Participation fo- port points out that over 60 per cent of integrity violations rums were hurriedly convened without adequate notice or doc- at the county level involve conflicts of interest, irregular al- umentation, and lacked feedback mechanisms, reducing civic lowances, and compromised oversight by assembly commit- engagement to a ritual to comply with constitutional edicts. tees. Similarly, the Council of Governors State of Devolution Report 2024 observed that frequent foreign benchmarking At the same time, the national government has reasserted Procurement remains the principal avenue of local state capture. trips and inflated sitting allowances have weakened assem- fiscal control through conditional grants and sectoral pro- The EACC s County Integrity Index 2024 reported that over 65 blies legislative productivity and audit follow-up functions.121 grammes implemented by state agencies such as the Kenya per cent of corruption cases in counties involved procurement ir- Rural Roads Authority KeRRA , the Kenya Urban Support regularities, including single sourcing, inflated pricing, and pay- In FY 2023 24, assemblies collectively spent an estimated KSh Programme KUSP , and the Kenya Medical Supplies Author- ment for work that had not been done.113 7.2 billion on travel and per diem, surpassing the combined allo- ity KEMSA .127 These arrangements frequently bypass county cation for public participation, audit follow-up, and legislative re- structures, contravening the Constitution, which envisages co- 105 Commission on Revenue Allocation, County Revenue Allocation search.122 Meanwhile, the Auditor General reported that only 19 of operation and equality between the two levels of government. Trends 2013 2024 106 National Treasury, County Allocations and Transfers Report 114 Controller of Budget, County Governments Budget Implementation The re-centralisation of key service functions has hollowed FY2023 24 Review Report FY2023 24 out devolution s intent. Counties retain responsibility for re- 107 Controller of Budget CoB , County Budget Implementation Review 115 Council of Governors, Health Sector Status Report 2024 sults but lack control over resources. This imbalance sus- Report 2023 24 116 Office of the Auditor-General, Performance Audit Report on the tains the very logic devolution was meant to resolve where 108 Office of the Auditor General OAG , County Audit Report 2024 Managed Equipment Services Project 2024 fiscal power and accountability remain vertically misaligned. 109 Council of Governors, County Pending Bills Status Report 2024 117 African Union, Maputo Declaration on Agriculture and Food Security 110 Constitution of Kenya 2010 , Article 185; County Governments Act 2003 . No. 17 of 2012, Section 8 Role of the County Assembly 118 Office of the Auditor-General, Agriculture Sector County Audit 2024 123 Office of the Auditor-General, County Assemblies Consolidated Audit 111 Institute of Public Finance IPF , Local Governance under Devolution: 119 Constitution of Kenya 2010 , Article 185 Review 2024 Power and Accountability in Kenya s Counties. 120 Ethics and Anti-Corruption Commission EACC , County Governance 124 Constitution of Kenya 2010 , Article 6 2 . 112 The Institute for Social Accountability TISA , Citizen Participation in Integrity Index Report 2024 125 Controller of Budget, County Governments Budget Implementation County Budgeting Study 2024 121 Council of Governors, State of Devolution Report 2024 Review Report FY2023 24 113 Ethics and Anti-Corruption Commission EACC , County Integrity Index 122 Controller of Budget, County Governments Budget Implementation 126 Council of Governors, State of Devolution Report 202 2024. Review Report FY2023 24 127 National Treasury, Conditional Grants and Transfers Analysis 2024",
    "page": 13,
    "tags": [
      "corruption",
      "statistic",
      "debt",
      "human_rights",
      "finding",
      "legal_reference"
    ],
    "severity": "low"
  }
]