[
  {
    "id": "para_000001",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA People s Audit Office of the Citizen From hustle to hardship Exposing the Cost of Kenya s Economic Betrayal",
    "page": 1,
    "category": "narrative"
  },
  {
    "id": "para_000002",
    "year": "2025",
    "text": "DECEMBER 8, 2025 2 OKOA UCHUMI CAMPAIGN CONVENED BY TISA List of Acronyms AfDB African Development Bank AML Anti-Money Laundering BO Beneficial Ownership BRS Business Registration Service CBK Central ",
    "page": 2,
    "category": "legal_reference"
  },
  {
    "id": "para_000003",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 3 FOREWORD The quest for sound public finance is A citizen-driven governance and defined by institutions and persons funds leak to corruption, US",
    "page": 3,
    "category": "recommendation"
  },
  {
    "id": "para_000004",
    "year": "2025",
    "text": "DECEMBER 8, 2025 4 OKOA UCHUMI CAMPAIGN CONVENED BY TISA Claiming people s sovereignty in public spending Office of the Citizen is the logical evolution of years -long efforts of the Okoa Uchumi Campa",
    "page": 4,
    "category": "recommendation"
  },
  {
    "id": "para_000005",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 5 Chapter 1: How the forgotten half lives Each morning, Kenyans wake up to the same bleak arithmetic: hunger in their homes, joblessness among th",
    "page": 5,
    "category": "allegation"
  },
  {
    "id": "para_000006",
    "year": "2025",
    "text": "DECEMBER 8, 2025 6 OKOA UCHUMI CAMPAIGN CONVENED BY TISA Figure 5: For point 1.3 Education system stews is a cocktail of confusion 9 billion in 2018.24 Thousands of youth who had been enrolled transfo",
    "page": 6,
    "category": "recommendation"
  },
  {
    "id": "para_000007",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 7 basic health care. tice for victims was buried under elite power-sharing pacts. Since Government snacks diet could pay for a million Kenyans he",
    "page": 7,
    "category": "finding"
  },
  {
    "id": "para_000008",
    "year": "2025",
    "text": "DECEMBER 8, 2025 8 OKOA UCHUMI CAMPAIGN CONVENED BY TISA Chapter 2: Where the rain started beating us 2.1 Big numbers hide a decade of plunder This concentration affects credit access and economic inc",
    "page": 8,
    "category": "recommendation"
  },
  {
    "id": "para_000009",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 9 2.3 Robbing Peter to pay the fat cats: Revenue performance The result is a growing perception among citizens that fiscal directed to recurrent ",
    "page": 9,
    "category": "recommendation"
  },
  {
    "id": "para_000010",
    "year": "2025",
    "text": "DECEMBER 8, 2025 10 OKOA UCHUMI CAMPAIGN CONVENED BY TISA rowing have tightened credit conditions for small and medium the quality of governance. The widening gap between pubThe governance implication",
    "page": 10,
    "category": "recommendation"
  },
  {
    "id": "para_000011",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 11 Chapter 3: A duel between the Constitution and corruption Economic recovery in Kenya cannot be separated from the health of the country s demo",
    "page": 11,
    "category": "recommendation"
  },
  {
    "id": "para_000012",
    "year": "2025",
    "text": "DECEMBER 8, 2025 12 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 3.1.4 Sabotaging good economic management 3.1.6 The political economy of fiscal capture The World Bank s Kenya Governance Diagnostic Assessmen",
    "page": 12,
    "category": "recommendation"
  },
  {
    "id": "para_000013",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 13 3.2 Cascading corruption to the subnational economy The result is not governance failure but its redesign. Counties the 47 assemblies debated ",
    "page": 13,
    "category": "finding"
  },
  {
    "id": "para_000014",
    "year": "2025",
    "text": "DECEMBER 8, 2025 14 OKOA UCHUMI CAMPAIGN CONVENED BY TISA At the citizen level, these structural tensions translate into tangiadministrative sanctions, including suspension of future disburseas shown ",
    "page": 14,
    "category": "recommendation"
  },
  {
    "id": "para_000015",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 15 3.3.5 Role of courts in enforcing anti-corruption laws State capture in Kenya is no longer a metaphor. It defines the operaal design. Subseque",
    "page": 15,
    "category": "recommendation"
  },
  {
    "id": "para_000016",
    "year": "2025",
    "text": "DECEMBER 8, 2025 16 OKOA UCHUMI CAMPAIGN CONVENED BY TISA plementation of the Nairobi Expressway Project 2023 tion Fund retained an idle KSh1.86 billion in commercial bank underscored these risks, cit",
    "page": 16,
    "category": "recommendation"
  },
  {
    "id": "para_000017",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 17 the primary mechanism of political capture; a governance order The 2024 2025 cost-of-living crisis illustrates this injustice. As orillicit ou",
    "page": 17,
    "category": "recommendation"
  },
  {
    "id": "para_000018",
    "year": "2025",
    "text": "DECEMBER 8, 2025 18 OKOA UCHUMI CAMPAIGN CONVENED BY TISA rectorate of Criminal Investigations DCI . Kenya s Okoa Uchumi movement and allied networks echo this approach. They highlight that fiscal con",
    "page": 18,
    "category": "recommendation"
  },
  {
    "id": "para_000019",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 19 curb corruption, and restore institutional credibility. been converted into a marketplace of elite bargains. governance choices made within a ",
    "page": 19,
    "category": "recommendation"
  },
  {
    "id": "para_000020",
    "year": "2025",
    "text": "DECEMBER 8, 2025 20 OKOA UCHUMI CAMPAIGN CONVENED BY TISA ken, replaced by an extractive relationship that trades compli3.8.5 Bad governance has a direct link to social stability and sion: governance ",
    "page": 20,
    "category": "recommendation"
  },
  {
    "id": "para_000021",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 21 the very cycle of corruption and inequality that constitutional is not inefficiency; it is injustice.249 Fiscal Ethics Indicators, 2014 2024 g",
    "page": 21,
    "category": "recommendation"
  },
  {
    "id": "para_000022",
    "year": "2025",
    "text": "DECEMBER 8, 2025 22 OKOA UCHUMI CAMPAIGN CONVENED BY TISA Kenya s Open Budget Index score declined from 55 in 2019 to 48 in tion by the EACC.259 Meanwhile, case-processing outcomes sugResponsiExpected",
    "page": 22,
    "category": "recommendation"
  },
  {
    "id": "para_000023",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 23 Procurement Regulatory Authority PPRA , in its Annual ReThis fusion of opaque campaign financing and public conport 2023, similarly found that",
    "page": 23,
    "category": "recommendation"
  },
  {
    "id": "para_000024",
    "year": "2025",
    "text": "DECEMBER 8, 2025 24 OKOA UCHUMI CAMPAIGN CONVENED BY TISA are suspended280. Such delays contravene Article 219 of the ConTable 16: Devolution and Local Integrity Reform Matrix Budget documentation fur",
    "page": 24,
    "category": "recommendation"
  },
  {
    "id": "para_000025",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 25 mus, structural compliance orders that require periodic reporthealth insurance subsidies. The Ministry of Health and the ing on the implementa",
    "page": 25,
    "category": "recommendation"
  },
  {
    "id": "para_000026",
    "year": "2025",
    "text": "DECEMBER 8, 2025 26 OKOA UCHUMI CAMPAIGN CONVENED BY TISA Citizen participation is the constitutional bridge between sov1. Technical barriers. Budget documents and audit Expectereignty and governance:",
    "page": 26,
    "category": "recommendation"
  },
  {
    "id": "para_000027",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 27 The M E framework operates through five interlinked levels of ports, feedback from each quarter should inform ongoing policy from first princi",
    "page": 27,
    "category": "recommendation"
  },
  {
    "id": "para_000028",
    "year": "2025",
    "text": "DECEMBER 8, 2025 28 OKOA UCHUMI CAMPAIGN CONVENED BY TISA pends on reestablishing integrity as a civic virtue and a policy principle. Article 73 of the ConstiEach reform measure proposed in this diagn",
    "page": 28,
    "category": "recommendation"
  },
  {
    "id": "para_000029",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 29 Parliament Parliament must reassert its constitutional control over public finance. It should enforce Standing A. Fiscal Governance, Transpare",
    "page": 29,
    "category": "recommendation"
  },
  {
    "id": "para_000030",
    "year": "2025",
    "text": "DECEMBER 8, 2025 30 OKOA UCHUMI CAMPAIGN CONVENED BY TISA D. Devolution and Local Governance Indicator Type Metric Frequency Responsible Body Rate of Audit RecommendaResponsible Performance IndicaRefo",
    "page": 30,
    "category": "recommendation"
  },
  {
    "id": "para_000031",
    "year": "2025",
    "text": "DECEMBER 8, 2025 OKOA UCHUMI CAMPAIGN CONVENED BY TISA 31 The Institute for Social Accountability TISA 2024 . Citizen Accountability and Budget Oversight Brief. Nairobi: TISA. Transparency Internation",
    "page": 31,
    "category": "statistic"
  },
  {
    "id": "para_000032",
    "year": "2025",
    "text": "DECEMBER 8, 2025 32 OKOA UCHUMI CAMPAIGN CONVENED BY TISA",
    "page": 32,
    "category": "narrative"
  }
]